In [1]:
import pandas as pd

### Part A: Data Ingestion & Transformation with Pandas

In [2]:
df=pd.read_csv('freshmart_products_csv - freshmart_products_csv.csv')

In [3]:
df

     ProductID ProductName   Category  Price  StockQuantity
0            1      Milk 1      Dairy  19.35          358.0
1            2      Cola 2  Beverages   9.99           81.0
2            3    Banana 3    Produce  30.33          112.0
3            4     Cream 4      Dairy  22.85          224.0
4            5     Cream 5      Dairy   3.85           97.0
..         ...         ...        ...    ...            ...
200         96    Apple 96    Produce   3.52          494.0
201         16   Coffee 16  Beverages  18.95          199.0
202         31    Apple 31    Produce  21.83           63.0
203        159     Tea 159  Beverages  19.14          242.0
204        129  Muffin 129     Bakery  42.96           63.0

[205 rows x 5 columns]

#### 2. Display the first 5 rows

In [4]:
df.head()
#df.head(5)

   ProductID ProductName   Category  Price  StockQuantity
0          1      Milk 1      Dairy  19.35          358.0
1          2      Cola 2  Beverages   9.99           81.0
2          3    Banana 3    Produce  30.33          112.0
3          4     Cream 4      Dairy  22.85          224.0
4          5     Cream 5      Dairy   3.85           97.0

In [5]:
df.describe()

        ProductID       Price  StockQuantity
count  205.000000  200.000000     200.000000
mean   100.151220   24.504300     264.050000
std     57.855902   14.141815     139.664809
min      1.000000    1.040000      11.000000
25%     50.000000   12.937500     145.500000
50%    100.000000   24.770000     266.500000
75%    150.000000   35.830000     394.000000
max    200.000000   49.510000     499.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ProductID      205 non-null    int64
 1   ProductName    205 non-null    object
 2   Category       205 non-null    object
 3   Price          200 non-null    float64
 4   StockQuantity  200 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 8.1+ KB

In [7]:
df.isnull().sum()

ProductID        0
ProductName      0
Category         0
Price            5
StockQuantity    5
dtype: int64

In [8]:
df[df['Price'].isnull()]

     ProductID       ProductName   Category  Price  StockQuantity
78          79          Bread 79     Bakery    NaN          199.0
98          99         Tomato 99    Produce    NaN          227.0
101        102         Apple 102    Produce    NaN          132.0
181        182          Milk 182      Dairy    NaN          409.0
195        196  Orange Juice 196  Beverages    NaN          489.0

In [9]:
df[df['StockQuantity'].isnull()]

     ProductID        ProductName   Category  Price  StockQuantity
6            7             Milk 7      Dairy  35.70            NaN
88          89     Granola Bar 89     Snacks  28.35            NaN
120        121      Croissant 121     Bakery   9.57            NaN
129        130        Lettuce 130    Produce  39.21            NaN
179        180  Mineral Water 180  Beverages  25.57            NaN

In [10]:
df['StockValue']=df['Price'] * df['StockQuantity']

In [11]:
df.isnull().sum()

ProductID         0
ProductName       0
Category          0
Price             5
StockQuantity     5
StockValue       10
dtype: int64

In [12]:
df[df['StockValue'].isnull()]

     ProductID        ProductName   Category  Price  StockQuantity  StockValue
6            7             Milk 7      Dairy  35.70            NaN         NaN
78          79           Bread 79     Bakery    NaN          199.0         NaN
88          89     Granola Bar 89     Snacks  28.35            NaN         NaN
98          99          Tomato 99    Produce    NaN          227.0         NaN
101        102          Apple 102    Produce    NaN          132.0         NaN
120        121      Croissant 121     Bakery   9.57            NaN         NaN
129        130        Lettuce 130    Produce  39.21            NaN         NaN
179        180  Mineral Water 180  Beverages  25.57            NaN         NaN
181        182           Milk 182      Dairy    NaN          409.0         NaN
195        196   Orange Juice 196  Beverages    NaN          489.0         NaN

In [13]:
df = df.fillna(0)

In [14]:
df.isnull().sum()

ProductID        0
ProductName      0
Category         0
Price            0
StockQuantity    0
StockValue       0
dtype: int64

In [15]:
avg_price=df['Price'].mean()
avg_price

23.90663414634146

In [16]:
df.describe()

        ProductID       Price  StockQuantity    StockValue
count  205.000000  205.000000     205.000000    205.000000
mean   100.151220   23.906634     257.609756   5905.074780
std     57.855902   14.472298     143.858843   5273.973902
min      1.000000    0.000000       0.000000      0.000000
25%     50.000000   12.560000     140.000000   1738.880000
50%    100.000000   22.970000     262.000000   4631.880000
75%    150.000000   35.700000     386.000000   8689.560000
max    200.000000   49.510000     499.000000  23562.010000

In [17]:
total_stock_quantity=df['StockQuantity'].sum()
total_stock_quantity

52810.0

### Part B: Data Storage with Postgresql

In [18]:
#Establishing a PostgreSQL connection using psycopg2

In [19]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\victoria ogunnaike\anaconda3\lib\site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [20]:
import psycopg2

In [29]:
#to connect to postgres
def get_db_connection():
    connection = psycopg2.connect(
        host = 'localhost',
        database = '10Alytics_Freshmart',
        user = 'postgres',
        password = '',
        port = '5432'
    )
    return connection

In [30]:
df_columns = df.columns
df_columns

Index(['ProductID', 'ProductName', 'Category', 'Price', 'StockQuantity',
       'StockValue'],
      dtype='object')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ProductID      205 non-null    int64
 1   ProductName    205 non-null    object
 2   Category       205 non-null    object
 3   Price          205 non-null    float64
 4   StockQuantity  205 non-null    float64
 5   StockValue     205 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 9.7+ KB

In [31]:
#create table in sql
def create_table():
    conn = get_db_connection()
    cursor = conn.cursor()
    print("Connection to database established successfully")
    create_table_query = """
                            CREATE SCHEMA IF NOT EXISTS freshmart;
                            
                            DROP TABLE IF EXISTS freshmarT.customers;
                            
                            CREATE TABLE IF NOT EXISTS freshmart.products (
                                ProductID INTEGER PRIMARY KEY,
                                ProductName TEXT,
                                Category TEXT,
                                Price FLOAT,
                                StockQuantity INTEGER,
                                StockValue FLOAT
                            );
                         """
    cursor.execute(create_table_query)
    conn.commit()
    cursor.close()
    print("Table creted successfully")

In [32]:
create_table()

Connection to database established successfully
Table creted successfully

In [35]:
#create table in sql
def create_table1():
    conn = get_db_connection()
    cursor = conn.cursor()
    print("Connection to database established successfully")
    create_table_query = """
                            CREATE SCHEMA IF NOT EXISTS freshmart;
                            
                            DROP TABLE IF EXISTS freshmart.products1;
                            
                            CREATE TABLE IF NOT EXISTS freshmart.products1 (
                                ProductID SERIAL PRIMARY KEY,
                                ProductName TEXT,
                                Category TEXT,
                                Price FLOAT,
                                StockQuantity INTEGER
                            );
                         """
    cursor.execute(create_table_query)
    conn.commit()
    cursor.close()
    print("Table created successfully")

In [36]:
create_table1()

Connection to database established successfully
Table created successfully

In [45]:
df1=df.iloc[0:]
df1

     ProductID ProductName   Category  Price  StockQuantity  StockValue
0            1      Milk 1      Dairy  19.35          358.0     6927.30
1            2      Cola 2  Beverages   9.99           81.0      809.19
2            3    Banana 3    Produce  30.33          112.0     3396.96
3            4     Cream 4      Dairy  22.85          224.0     5118.40
4            5     Cream 5      Dairy   3.85           97.0      373.45
..         ...         ...        ...    ...            ...         ...
200         96    Apple 96    Produce   3.52          494.0     1738.88
201         16   Coffee 16  Beverages  18.95          199.0     3771.05
202         31    Apple 31    Produce  21.83           63.0     1375.29
203        159     Tea 159  Beverages  19.14          242.0     4631.88
204        129  Muffin 129     Bakery  42.96           63.0     2706.48

[205 rows x 6 columns]

In [64]:
def load_data():
    conn = get_db_connection()
    cursor = conn.cursor()
    print("Connection to database established successfully")
    for _, row in df.iterrows():
        cursor.execute("""
                        INSERT INTO freshmart.products (ProductID, ProductName, Category, Price, StockQuantity)
                        VALUES (%s, %s, %s, %s, %s);
                    """, (row["ProductID"], row["ProductName"], row["Category"], row["Price"], row["StockQuantity"]))
    conn.commit()
    cursor.close()
    print("Table created successfully")

In [65]:
load_data()

Connection to database established successfully

TypeError: tuple indices must be integers or slices, not str

In [50]:
df.iterrows()

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ProductID      205 non-null    int64
 1   ProductName    205 non-null    object
 2   Category       205 non-null    object
 3   Price          205 non-null    float64
 4   StockQuantity  205 non-null    float64
 5   StockValue     205 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 9.7+ KB

In [53]:
df['StockQuantity']=df['StockQuantity'].astype(int)

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ProductID      205 non-null    int64
 1   ProductName    205 non-null    object
 2   Category       205 non-null    object
 3   Price          205 non-null    float64
 4   StockQuantity  205 non-null    int32
 5   StockValue     205 non-null    float64
dtypes: float64(2), int32(1), int64(1), object(2)
memory usage: 8.9+ KB

In [ ]:
df1=df[['ProductID','ProductName','']]

In [74]:
conn = get_db_connection()
cursor = conn.cursor()
for index, row in df.iterrows():
    cursor.execute("""INSERT INTO freshmart.products1 (ProductID, ProductName, Category, Price, StockQuantity)
                   VALUES (%s, %s, %s, %s, %s);""", (row['ProductID'], row['ProductName'], row['Category'], row['Price'], row['StockQuantity']))

# Commit the changes and close the connection
conn.commit()
conn.close()

UniqueViolation: duplicate key value violates unique constraint "products1_pkey"
DETAIL:  Key (productid)=(96) already exists.

In [75]:
#at the point of insertion, i realized there were duplicate records

In [85]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
200     True
201     True
202    False
203     True
204     True
Length: 205, dtype: bool

In [84]:
df.duplicated().sum()

4

In [88]:
df=df.drop_duplicates()

In [90]:
df.duplicated().sum()

0

In [93]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
196    False
197    False
198    False
199    False
202    False
Length: 201, dtype: bool

In [91]:
conn = get_db_connection()
cursor = conn.cursor()
for index, row in df.iterrows():
    cursor.execute("""INSERT INTO freshmart.products1 (ProductID, ProductName, Category, Price, StockQuantity)
                   VALUES (%s, %s, %s, %s, %s);""", (row['ProductID'], row['ProductName'], row['Category'], row['Price'], row['StockQuantity']))

# Commit the changes and close the connection
conn.commit()
conn.close()

UniqueViolation: duplicate key value violates unique constraint "products1_pkey"
DETAIL:  Key (productid)=(31) already exists.

In [97]:
df.duplicated('ProductID')

0      False
1      False
2      False
3      False
4      False
       ...
196    False
197    False
198    False
199    False
202     True
Length: 201, dtype: bool

In [98]:
df[df.duplicated('ProductID')]

     ProductID ProductName Category  Price  StockQuantity  StockValue
202         31    Apple 31  Produce  21.83             63     1375.29

In [105]:
df[df['ProductID']==31]

     ProductID ProductName Category  Price  StockQuantity  StockValue
30          31    Apple 31   snakcs  21.83             63     1375.29
202         31    Apple 31  Produce  21.83             63     1375.29

In [ ]:
df[(df['ProductID']==31) & (df['Category']=='snakcs')]

In [107]:
df=df.drop(df[(df['ProductID']==31) & (df['Category']=='snakcs')].index)

In [110]:
df[df['ProductID']==31]

     ProductID ProductName Category  Price  StockQuantity  StockValue
202         31    Apple 31  Produce  21.83             63     1375.29

In [111]:
conn = get_db_connection()
cursor = conn.cursor()
for index, row in df.iterrows():
    cursor.execute("""INSERT INTO freshmart.products1 (ProductID, ProductName, Category, Price, StockQuantity)
                   VALUES (%s, %s, %s, %s, %s);""", (row['ProductID'], row['ProductName'], row['Category'], row['Price'], row['StockQuantity']))

# Commit the changes and close the connection
conn.commit()
conn.close()

### Query the database

In [119]:
conn = get_db_connection()
cursor = conn.cursor()
query = """
        SELECT *
        FROM freshmart.products1
        WHERE UPPER(category)='DAIRY'
"""
# Commit the changes and close the connection
cursor.execute(query)
df4_1 = cursor.fetchall
conn.commit()
conn.close()

In [124]:
#4.1 query to fetch all products in the dairy category
conn = get_db_connection()
query = """
        SELECT *
        FROM freshmart.products1
        WHERE UPPER(category)='DAIRY'
"""
# Commit the changes and close the connection
df4_1 = pd.read_sql_query(query,conn)
conn.close()
df4_1

C:\Users\Victoria Ogunnaike\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    productid productname category  price  stockquantity
0         131  Cheese 131    Dairy  42.70            122
1         140  Yogurt 140    Dairy   1.89            407
2         141    Milk 141    Dairy  16.94            413
3         149   Cream 149    Dairy  44.71            292
4           1      Milk 1    Dairy  19.35            358
5           4     Cream 4    Dairy  22.85            224
6           5     Cream 5    Dairy   3.85             97
7           7      Milk 7    Dairy  35.70              0
8          10    Cream 10    Dairy   1.04            453
9          11   Tomato 11    dairy   9.99            469
10         19   Butter 19    Dairy  49.18            140
11         20   Yogurt 20    Dairy  43.14            144
12         24   Butter 24    Dairy  19.89            355
13         25    Cream 25    Dairy   5.79            349
14         29   Cheese 29    Dairy  20.16             59
15         58     Milk 58    Dairy  24.14            110
16         61   Butter 61    Dairy  12.56            407
17         65     Milk 65    Dairy  10.88            361
18         70   Yogurt 70    Dairy  38.02             45
19         80   Yogurt 80    Dairy   6.39            386
20         82   Cheese 82    Dairy  41.08            242
21         84   Butter 84    Dairy  26.03            146
22         85    Cream 85    Dairy  24.76            234
23         95   Cheese 95    Dairy  48.85            229
24        101    Milk 101    Dairy  30.04            448
25        103  Yogurt 103    Dairy  12.87            303
26        104   Cream 104    Dairy  19.02            381
27        112  Butter 112    Dairy  26.09            156
28        115    Milk 115    Dairy  20.48             48
29        116  Butter 116    Dairy  46.90            138
30        125    Milk 125    Dairy  28.36            169
31        127  Cheese 127    Dairy  14.66            156
32        161  Butter 161    Dairy  21.98            190
33        163    Milk 163    Dairy  42.80            200
34        167  Cheese 167    Dairy  28.28            232
35        172   Cream 172    Dairy  13.45            499
36        175    Milk 175    Dairy  35.42            185
37        182    Milk 182    Dairy   0.00            409
38        184    Milk 184    Dairy  17.56            101
39        189    Milk 189    Dairy  42.11             67
40        190  Cheese 190    Dairy   2.49            189
41        195  Yogurt 195    Dairy  31.52            205

In [125]:
#4.2 query to fetch all products with stockquantity<50
conn = get_db_connection()
query = """
        SELECT *
        FROM freshmart.products1
        WHERE StockQuantity<50
"""
# Commit the changes and close the connection
df4_2 = pd.read_sql_query(query,conn)
conn.close()
df4_2

C:\Users\Victoria Ogunnaike\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    productid        productname   category  price  stockquantity
0         130        Lettuce 130    Produce  39.21              0
1         146          Apple 146    Produce  32.18             31
2         147          Chips 147     Snacks  12.96             47
3           7             Milk 7      Dairy  35.70              0
4          30    Orange Juice 30  Beverages  33.46             11
5          57           Bread 57     Bakery  14.46             44
6          70          Yogurt 70      Dairy  38.02             45
7          89     Granola Bar 89     Snacks  28.35              0
8         115           Milk 115      Dairy  20.48             48
9         121      Croissant 121     Bakery   9.57              0
10        126          Chips 126     Snacks  32.02             18
11        154    Granola Bar 154     Snacks  25.46             13
12        158      Croissant 158     Bakery  14.70             15
13        166         Carrot 166    Produce  24.78             27
14        180  Mineral Water 180  Beverages  25.57              0

In [123]:
df4_1

In [121]:
pd.DataFrame(df4_1)

ValueError: DataFrame constructor not properly called!

In [122]:
df4_11 = pd.DataFrame(df4_1)

ValueError: DataFrame constructor not properly called!